This is what I got, having waited until the end:
```
$ YC_TOKEN=$(yc iam create-token) terraform apply
yandex_iam_service_account.terraform: Refreshing state... [id=aje0keregj8fdd9ddmvh]
yandex_iam_service_account_static_access_key.tf-static-key: Refreshing state... [id=aje8h06htno3tenmkhab]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # yandex_storage_bucket.bucket-demo will be created
  + resource "yandex_storage_bucket" "bucket-demo" {
      + access_key         = "eFhLJK8jaP1Ybw_DBi3A"
      + acl                = "private"
      + bucket             = "bucket-demo-adadadad"
      + bucket_domain_name = (known after apply)
      + force_destroy      = false
      + id                 = (known after apply)
      + secret_key         = (sensitive value)
      + website_domain     = (known after apply)
      + website_endpoint   = (known after apply)

      + versioning {
          + enabled = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

yandex_storage_bucket.bucket-demo: Creating...
yandex_storage_bucket.bucket-demo: Still creating... [10s elapsed]
yandex_storage_bucket.bucket-demo: Still creating... [20s elapsed]
yandex_storage_bucket.bucket-demo: Still creating... [30s elapsed]
yandex_storage_bucket.bucket-demo: Still creating... [40s elapsed]
yandex_storage_bucket.bucket-demo: Still creating... [50s elapsed]
yandex_storage_bucket.bucket-demo: Still creating... [1m0s elapsed]
yandex_storage_bucket.bucket-demo: Still creating... [1m10s elapsed]
yandex_storage_bucket.bucket-demo: Still creating... [1m20s elapsed]
yandex_storage_bucket.bucket-demo: Still creating... [1m30s elapsed]
yandex_storage_bucket.bucket-demo: Still creating... [1m40s elapsed]
yandex_storage_bucket.bucket-demo: Still creating... [1m50s elapsed]
yandex_storage_bucket.bucket-demo: Still creating... [2m0s elapsed]
yandex_storage_bucket.bucket-demo: Still creating... [2m10s elapsed]
yandex_storage_bucket.bucket-demo: Still creating... [2m20s elapsed]
yandex_storage_bucket.bucket-demo: Still creating... [2m30s elapsed]
yandex_storage_bucket.bucket-demo: Still creating... [2m40s elapsed]
yandex_storage_bucket.bucket-demo: Still creating... [2m50s elapsed]
yandex_storage_bucket.bucket-demo: Still creating... [3m0s elapsed]
yandex_storage_bucket.bucket-demo: Still creating... [3m10s elapsed]
yandex_storage_bucket.bucket-demo: Still creating... [3m20s elapsed]
yandex_storage_bucket.bucket-demo: Still creating... [3m30s elapsed]
yandex_storage_bucket.bucket-demo: Still creating... [3m40s elapsed]
yandex_storage_bucket.bucket-demo: Still creating... [3m50s elapsed]
yandex_storage_bucket.bucket-demo: Still creating... [4m0s elapsed]
yandex_storage_bucket.bucket-demo: Still creating... [4m10s elapsed]
yandex_storage_bucket.bucket-demo: Still creating... [4m20s elapsed]
yandex_storage_bucket.bucket-demo: Still creating... [4m30s elapsed]
yandex_storage_bucket.bucket-demo: Still creating... [4m40s elapsed]
yandex_storage_bucket.bucket-demo: Still creating... [4m50s elapsed]

Error: error creating Storage Bucket: error creating Storage Bucket bucket-demo-adadadad, retrying: AccessDenied: Access Denied
	status code: 403, request id: 815d296e122afadc, host id: 

  on main.tf line 32, in resource "yandex_storage_bucket" "bucket-demo":
  32: resource "yandex_storage_bucket" "bucket-demo" {
```
The result makes sense as there is no permission to create buckets for the SA used.